{
  "backend": "tensorflow",
  "config": [
    {
      "config": {
        "epsilon": 0.001,
        "gamma_regularizer": null,
        "axis": 3,
        "beta_constraint": null,
        "moving_variance_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "beta_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "trainable": true,
        "momentum": 0.99,
        "gamma_initializer": {
          "config": {},
          "class_name": "Ones"
        },
        "center": true,
        "scale": true,
        "gamma_constraint": null,
        "beta_regularizer": null,
        "moving_mean_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "batch_input_shape": [
          null,
          160,
          320,
          3
        ],
        "dtype": "float32",
        "name": "batch_normalization_10"
      },
      "class_name": "BatchNormalization"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_size": [
          5,
          5
        ],
        "kernel_constraint": null,
        "data_format": "channels_last",
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "filters": 24,
        "padding": "valid",
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "strides": [
          2,
          2
        ],
        "dilation_rate": [
          1,
          1
        ],
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "conv2d_41"
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_size": [
          5,
          5
        ],
        "kernel_constraint": null,
        "data_format": "channels_last",
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "filters": 36,
        "padding": "valid",
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "strides": [
          2,
          2
        ],
        "dilation_rate": [
          1,
          1
        ],
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "conv2d_42"
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_size": [
          5,
          5
        ],
        "kernel_constraint": null,
        "data_format": "channels_last",
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "filters": 48,
        "padding": "valid",
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "strides": [
          2,
          2
        ],
        "dilation_rate": [
          1,
          1
        ],
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "conv2d_43"
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_size": [
          3,
          3
        ],
        "kernel_constraint": null,
        "data_format": "channels_last",
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "filters": 64,
        "padding": "valid",
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "strides": [
          1,
          1
        ],
        "dilation_rate": [
          1,
          1
        ],
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "conv2d_44"
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_size": [
          3,
          3
        ],
        "kernel_constraint": null,
        "data_format": "channels_last",
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "filters": 64,
        "padding": "valid",
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "strides": [
          1,
          1
        ],
        "dilation_rate": [
          1,
          1
        ],
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "conv2d_45"
      },
      "class_name": "Conv2D"
    },
    {
      "config": {
        "trainable": true,
        "name": "flatten_9"
      },
      "class_name": "Flatten"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_constraint": null,
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "units": 1164,
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "dense_41"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_constraint": null,
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "units": 100,
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "dense_42"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_constraint": null,
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "units": 50,
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "dense_43"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_constraint": null,
        "bias_constraint": null,
        "activation": "relu",
        "bias_regularizer": null,
        "units": 10,
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "dense_44"
      },
      "class_name": "Dense"
    },
    {
      "config": {
        "kernel_initializer": {
          "config": {
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null,
            "scale": 1.0
          },
          "class_name": "VarianceScaling"
        },
        "kernel_constraint": null,
        "bias_constraint": null,
        "activation": "tanh",
        "bias_regularizer": null,
        "units": 1,
        "trainable": true,
        "bias_initializer": {
          "config": {},
          "class_name": "Zeros"
        },
        "use_bias": true,
        "kernel_regularizer": null,
        "activity_regularizer": null,
        "name": "dense_45"
      },
      "class_name": "Dense"
    }
  ],
  "class_name": "Sequential",
  "keras_version": "2.0.9"
}