{
  "class_name": "Sequential",
  "backend": "tensorflow",
  "config": [
    {
      "class_name": "BatchNormalization",
      "config": {
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "batch_input_shape": [
          null,
          64,
          128,
          3
        ],
        "name": "batch_normalization_2",
        "gamma_regularizer": null,
        "gamma_constraint": null,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "center": true,
        "beta_constraint": null,
        "dtype": "float32",
        "axis": 1,
        "trainable": true,
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "momentum": 0.99,
        "epsilon": 0.001,
        "scale": true
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "activation": "relu",
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "kernel_size": [
          5,
          5
        ],
        "activity_regularizer": null,
        "trainable": true,
        "filters": 24,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "name": "conv2d_6",
        "strides": [
          2,
          2
        ],
        "dilation_rate": [
          1,
          1
        ],
        "data_format": "channels_last",
        "padding": "valid",
        "bias_constraint": null,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "activation": "relu",
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "kernel_size": [
          5,
          5
        ],
        "activity_regularizer": null,
        "trainable": true,
        "filters": 36,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "name": "conv2d_7",
        "strides": [
          2,
          2
        ],
        "dilation_rate": [
          1,
          1
        ],
        "data_format": "channels_last",
        "padding": "valid",
        "bias_constraint": null,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "activation": "relu",
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "kernel_size": [
          5,
          5
        ],
        "activity_regularizer": null,
        "trainable": true,
        "filters": 48,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "name": "conv2d_8",
        "strides": [
          2,
          2
        ],
        "dilation_rate": [
          1,
          1
        ],
        "data_format": "channels_last",
        "padding": "valid",
        "bias_constraint": null,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "activation": "relu",
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "kernel_size": [
          3,
          3
        ],
        "activity_regularizer": null,
        "trainable": true,
        "filters": 64,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "name": "conv2d_9",
        "strides": [
          1,
          1
        ],
        "dilation_rate": [
          1,
          1
        ],
        "data_format": "channels_last",
        "padding": "valid",
        "bias_constraint": null,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "activation": "relu",
        "kernel_regularizer": null,
        "kernel_constraint": null,
        "kernel_size": [
          3,
          3
        ],
        "activity_regularizer": null,
        "trainable": true,
        "filters": 64,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "name": "conv2d_10",
        "strides": [
          1,
          1
        ],
        "dilation_rate": [
          1,
          1
        ],
        "data_format": "channels_last",
        "padding": "valid",
        "bias_constraint": null,
        "bias_regularizer": null
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "trainable": true,
        "name": "flatten_2"
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_6",
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "activation": "relu",
        "activity_regularizer": null,
        "trainable": true,
        "bias_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "units": 1164,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_7",
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "activation": "relu",
        "activity_regularizer": null,
        "trainable": true,
        "bias_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "units": 100,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_8",
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "activation": "relu",
        "activity_regularizer": null,
        "trainable": true,
        "bias_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "units": 50,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_9",
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "activation": "relu",
        "activity_regularizer": null,
        "trainable": true,
        "bias_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "units": 10,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "dense_10",
        "kernel_constraint": null,
        "kernel_regularizer": null,
        "activation": "tanh",
        "activity_regularizer": null,
        "trainable": true,
        "bias_regularizer": null,
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "distribution": "uniform",
            "mode": "fan_avg",
            "seed": null,
            "scale": 1.0
          }
        },
        "units": 1,
        "bias_constraint": null
      }
    }
  ],
  "keras_version": "2.0.9"
}